Revit 2024 API
ExternalFileUtils.GetFileBasedTempFolder Method
 Gets a temp folder based on the given file name
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public static string GetFileBasedTempFolder(
	string filename
)
Visual Basic
Public Shared Function GetFileBasedTempFolder ( _
	filename As String _
) As String
Visual C++
public:
static String^ GetFileBasedTempFolder(
	String^ filename
)
Parameters
filename
Type: System.String
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ExternalFileUtils Class
Autodesk.Revit.DB Namespace